struts.html
<!DOCTYPE html>
<html>
<head>
<title>struts</title>
<!-- 2016-10-18 周二 07:35 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="imfine">
<link rel="stylesheet" href="ss.css">
</head>
<body>
<div id="content">
<h1 class="title">struts</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Preclue</a></li>
<li><a href="#sec-2">框架</a></li>
<li><a href="#sec-3">简介</a></li>
<li><a href="#sec-4">示例（注册登录）</a>
<ul>
<li><a href="#sec-4-1">业务分析</a></li>
<li><a href="#sec-4-2">实现步骤：</a></li>
</ul>
</li>
<li><a href="#sec-5">Package</a></li>
<li><a href="#sec-6">Action</a></li>
<li><a href="#sec-7">Result</a>
<ul>
<li><a href="#sec-7-1">dispatcher/redirect</a></li>
<li><a href="#sec-7-2">chain/redirectAction</a></li>
<li><a href="#sec-7-3">stream</a></li>
</ul>
</li>
<li><a href="#sec-8">流程</a></li>
<li><a href="#sec-9">拦截器</a>
<ul>
<li><a href="#sec-9-1">原理</a></li>
<li><a href="#sec-9-2">定义</a></li>
<li><a href="#sec-9-3">示例</a></li>
</ul>
</li>
<li><a href="#sec-10">自动封装(Autowired)</a></li>
<li><a href="#sec-11">值栈</a>
<ul>
<li><a href="#sec-11-1">在 jsp 中获取值栈的值</a></li>
<li><a href="#sec-11-2">在 action 类中，获取 session 等对象的方法</a></li>
</ul>
</li>
<li><a href="#sec-12">标签库</a></li>
<li><a href="#sec-13">验证</a></li>
<li><a href="#sec-14">类型转换</a></li>
<li><a href="#sec-15">国际化</a></li>
<li><a href="#sec-16">文件的上传下载</a></li>
<li><a href="#sec-17">防止重复提交</a></li>
<li><a href="#sec-18">ajax</a></li>
</ul>
</div>
</nav>


<section id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Preclue</h2>
<div class="outline-text-2" id="text-1">
<p>
Tomcat 编译 jsp 到 java 文件的保存目录：
</p>
<pre class="example">
E:\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp0\work\Catalina\localhost\hello\org\apache\jsp\WEB_002dINF\login
</pre>
</div>
</section>

<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">框架</h2>
<div class="outline-text-2" id="text-2">
<p>
框架是一个半成品。它提供了一些接口、类、方法，我们可以直接调用。
</p>

<p>
所以使用框架，相当于在别人开发了一半的项目上继续开发。
</p>

<p>
因此，框架有以下优势：
</p>
<ol class="org-ol">
<li>能提高我们的开发效率。
</li>
<li>能大幅度减少我们的代码量。
</li>
<li>能提高代码的健壮性。比如，jquery的跨浏览器问题。
</li>
</ol>
</div>
</section>


<section id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">简介</h2>
<div class="outline-text-2" id="text-3">
<p>
Struts2 是一个流行的 MVC 框架。
</p>

<p>
官方网站：<a href="https://struts.apache.org/">https://struts.apache.org/</a>
</p>


<p>
导入 struts-blank 项目有两种方式： maven 方式和一般方式。下面介绍一般的方式：
</p>
<ol class="org-ol">
<li>在 eclipse 中，选择新建一个 dynamic web project，例如名字为 ls02.
</li>
<li>将 src/apps/blank/src/main/java 下的文件复制到 workspace/ls02/src 文件夹下。
</li>
<li>将 src/apps/blank/src/main/resources 下的文件复制到 workspace/ls02/src 文件夹下。
</li>
<li>将 src/apps/blank/src/main/webapp 下的文件复制到 workspace/ls02/WebContent 文件夹下。
</li>
<li>将相关的 jar 包放到 workspace/ls02/WebContent/WEB-INF/lib 文件夹下。
</li>
</ol>

<p>
需要的jar包有以下：
</p>
<ul class="org-ul">
<li>asm-3.3.jar
</li>
<li>asm-commons-3.3.jar
</li>
<li>asm-tree-3.3.jar
</li>
<li>commons-fileupload-1.3.2.jar
</li>
<li>commons-io-2.2.jar
</li>
<li>commons-lang3-3.2.jar
</li>
<li>hamcrest-core-1.3.jar
</li>
<li>javassist-3.11.0.GA.jar
</li>
<li>javax.servlet-api-3.1.0.jar
</li>
<li>javax.servlet.jsp-api-2.3.1.jar
</li>
<li>jstl-1.2.jar
</li>
<li>junit-4.12.jar
</li>
<li>log4j-1.2.17.jar
</li>
<li>ognl-3.0.19.jar
</li>
<li>ojdbc7.jar
</li>
<li>struts2-core-2.3.30.jar
</li>
<li>struts2-json-plugin-2.3.30.jar
</li>
<li>xwork-core-2.3.30.jar
</li>
</ul>
</div>
</section>

<section id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">示例（注册登录）</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">业务分析</h3>
<div class="outline-text-3" id="text-4-1">
<p>
我们需要以下四个请求：、
</p>
<ol class="org-ol">
<li>第一个请求：<br >
   显示登录的页面。  login.jsp
</li>

<li>第二个请求：<br >
   点击登录之后，要完成登录的操作。
welcome.jsp
fail.jsp
</li>

<li>第三个请求：<br >
   显示注册的页面。
regist.jsp
</li>

<li>第四个请求：<br >
   点击“注册”按钮之后，完成注册的操作。
login.jsp
regerror.jsp
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">实现步骤：</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li><b>建立动态web项目。</b>

<p>
打开 eclipse，选择 File -&gt; New -&gt; Dynamic Web Project(快捷键为Ctrl-N)。
</p>

<p>
注意，工程名字尽量简洁，尽量用小写字母和_的组合。
</p>

<p>
注意，在创建的工程的时候，将创建 web.xml 的选项勾上。
因为在 servlet3 版本中，可以不需要 web.xml 的情况下运行 web 工程，但是我们要使用 struts2，必须要在 web.xml 中进行若干的配置。
</p>
</li>

<li><b>将相关的 jar 包，复制到 工程目录/WebContent/WEB-INF/lib 文件夹下面。</b>

<p>
注意，一定不要缺少某些关键包，否则可能会报错。
</p>

<p>
注意，如果出现一些莫名其妙的问题，包括像报 ClassNotFound 的异常，这时候，首先要检查是否有 jar 包的缺失。
</p>
</li>

<li><b>配置 web.xml，将所有的请求交给 struts 进行处理。</b>

<p>
即在 web.xml 中添加以下内容：
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #000088; background-color: #DEDEDE;">filter</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">filter-name</span>&gt;struts&lt;/<span style="color: #000088; background-color: #DEDEDE;">filter-name</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">filter-class</span>&gt;org.apache.struts2.dispatcher.ng.filter.StrutsPrepareAndExecuteFilter&lt;/<span style="color: #000088; background-color: #DEDEDE;">filter-class</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">filter</span>&gt;
&lt;<span style="color: #000088; background-color: #DEDEDE;">filter-mapping</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">filter-name</span>&gt;struts&lt;/<span style="color: #000088; background-color: #DEDEDE;">filter-name</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">url-pattern</span>&gt;/*&lt;/<span style="color: #000088; background-color: #DEDEDE;">url-pattern</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">filter-mapping</span>&gt;
</pre>
</div>

<p>
注意： filter-name 是可以随意定义的，不过上下两个节点要填写一致，不要搞错。
</p>

<p>
注意： 要确保 filter-class 的值写正确，这是一个确切存在的过滤器类。可以通过查看 struts2-core.jar 的源码去确定。
</p>

<p>
注意： 在 elipse 左边的 Web App Libraries 下面，找到 struts2-core.jar，打开节点，直到 StrutsPrepareAndExecuteFilter，然后右键点击，选择 Copy Qualified Name，这样就把这个过滤器的完整路径复制下来了。然后就可以在 web.xml 中进行粘贴了。
</p>

<p>
注意： 如果创建完工程之后，发现没有 web.xml，那么你需要自己创建或者从其他地方拷贝一个 web.xml 过来。但是注意，一定不要讲文件放错位置（WebContent/WEB-INF/web.xml）。而且，要注意 xml 中头部务必要写正确， xml 的格式也不能出现问题。
</p>

<p>
注意： 以前的老旧版本中，使用的是过滤器 org.apache.struts2.dispatcher.FilterDispatcher。但现在已经被抛弃，不要使用，而是用 StrutsPrepareAndExecuteFilte代替。
</p>
</li>

<li><b>创建文件 struts.xml，配置所有模块和请求，即配置相应的 package 和 action。</b>

<p>
这是 struts 的配置中心，所有的 struts 属性配置和请求映射，都在这个文件夹中进行action设置。
</p>

<p>
需要将这个文件放在 classpath 的根目录下面。我们可以理解，我们需要在 工程目录/src 文件夹下面创建这个文件。
</p>

<p>
如果我们创建的工程能够运行起来不报错，但是我们的 action 请求返回404错误的话，首先需要检查我们的请求有没有写错，如果没有写错，那么，就要检查是不是我们的 struts.xml 放错了位置或写错了名字。
</p>

<p>
如果我们的工程能够运行，但是在请求的时候，返回一些比如 result 没有正确映射等错误，那么，我们就需要检查是不是在 struts.xml 中配置错了东西。
</p>

<p>
struts.xml，最好我们备份一份，在创建的时候，直接拷贝。因为，这个文件的格式，尤其是头部：
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #0000FF;">xml</span> <span style="color: #BA36A5;">version</span>=<span style="color: #008000;">"</span><span style="color: #008000;">1.0</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">encoding</span>=<span style="color: #008000;">"</span><span style="color: #008000;">UTF-8</span><span style="color: #008000;">"</span> ?&gt;
&lt;!<span style="color: #0000FF;">DOCTYPE</span> struts <span style="color: #0000FF;">PUBLIC</span>
 <span style="color: #036A07;">"</span><span style="color: #036A07;">-//Apache Software Foundation//DTD Struts Configuration 2.3//EN</span><span style="color: #036A07;">"</span>
 <span style="color: #036A07;">"</span><span style="color: #036A07;">http://struts.apache.org/dtds/struts-2.3.dtd</span><span style="color: #036A07;">"</span>&gt;

&lt;<span style="color: #000088; background-color: #DEDEDE;">struts</span>&gt;
   &lt;<span style="color: #000088; background-color: #DEDEDE;">package</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">package</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">struts</span>&gt;
</pre>
</div>
<p>
头部的 dtd 文件可以在 struts2-core.jar 的根目录之下找到。里面可以拷贝到 DOCTYPE 的定义。
</p>

<p>
注意， <b>一个请求对应一个 action</b> 。这个概念务必要理解。另外，一个业务模块定义在一个 package 中，这个也要掌握。
</p>

<p>
我们可以使用通配符来简化 action 配置。但务必不要滥用通配符，尤其刚开始的时候不建议过多使用通配符。
</p>
</li>

<li><b>实现相应的 jsp</b>

<p>
一些比较敏感的，尤其是涉及权限的东西，我们最好放在 WEB-INF 目录下面，因为按照 j2ee 的规范， WEB-INF 目录下的内容，不能够由外部直接访问，所以能够最大限度保证安全。
</p>

<p>
那我们也要养成一种习惯，把主要的业务操作方面的 jsp 放在 WEB-INF 下面，一些其他的通用的不重要的资源可以放在 WEB-INF 外面。
</p>
</li>

<li><b>实现相应的 action</b>

<p>
Action 中的每个执行业务的方法，只有一个要求，不携带参数并返回 String 类型。而一个 action 就是一个普通的 java 对象。不过为了方便，绝大多数时候我们要为我们自己定义的 Action 继承 ActionSupport 类。
</p>

<p>
需要注意，必须要养成良好的编程习惯。习惯成自然，不要让不好的习惯带给我们一些莫名其妙的损失。
</p>

<p>
下面是一些基本的规范：
</p>
<ul class="org-ul">
<li>我们写类跟接口之前，必须要定义一个相对完整的包。尤其忌讳把所有的东西都放在 classpath 的跟路径之下。
</li>
<li>包的名字要有相应的意义，不同种类的类或接口要放在不同的包中，不要混乱地放在一起。
</li>
<li>包的名字，务必要用小写字母。
</li>
<li>类或接口的名字，务必务必要用大写字母开头，而且要写成驼峰格式。
</li>
<li>里面的方法也要写成驼峰形式。
</li>
<li>格式要对齐，文件中要么都是用 tab，要么都使用空格，不建议混用，否则，可能在别人的电脑上，会出现代码对不齐的现象。
</li>
<li>等号等操作符的前面和后面，要带有空格，便于阅读。
</li>
</ul>
</li>
</ol>
</div>
</div>
</section>

<section id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Package</h2>
<div class="outline-text-2" id="text-5">
<p>
在 struts.xml 中首先需要定义 package，package 我们可以理解为一个业务模块。
</p>

<p>
一个系统有多个功能，即有多个业务模块，表现在 struts.xml 中就是有多个 package。一个业务模块需要请求很多页面，相应一个 package 包含多个 action.
</p>

<p>
注意：必须要有模块化的概念，为业务创建相关的 package 和 namespace，这样便于管理维护，也便于功能的扩展。
</p>

<p>
定义 package 需要给予一个名字，还可以设置命名空间（默认为 / ）和父包。
</p>

<p>
我们自定义的 package 最好继承 struts-default 包，它定义在 struts-default.xml 中（可以展开 struts2-core.jar 看到）。这个 package 内置了一些 result 类型，一些拦截器，并配置了一些常见的 struts 常量。我们可以直接使用。
</p>

<p>
Package 主要由 action 构成，除此之外，还可以声明拦截器，配置包范围的异常处理，定义包范围的 result。
</p>
</div>
</section>
