struts.org
* Action
action 必须要有的属性是 name，这个定义了这个 action 的唯一标识。 class如果不指定的话，那么默认是 ActionSupport 类。 method 不指定的话，默认是 execute 方法。

action 至少要有一个节点，就是 result。如果 result 不去指定 name 的话，那么它的默认名字就是 success.

action 下面可以定义一到多个异常处理节点，用来捕获本次请求出现的指定异常。
: <exception-mapping result="fail" exception="java.lang.Exception"></exception-mapping>

如果请求的过程中，出现异常，那么 struts 首先判断当前 action 节点下面有没有配置相关的 exception-mapping 节点，如果有并且异常匹配，那么页面会转到本异常处理节点指定的页面。

如果 action 节点下面没有配置相关的 exception-mapping，那么 struts 会到当前包下面搜索，有没有配置 global-exception-mapping 节点。如果有配置，那么，就会根据所匹配的异常处理，进行返回结果。

如果 action 节点下面没有配置，而且包下面没有配置，那么，就不会有相应的异常处理。服务器会把一个 404 等相关的错误页面直接打印给用户。（这样首先不美观，不专业，其次，非常不安全。）

异常处理，可以在当前 action 节点下面配置。相应的，可以在 package 下面配置全局的异常处理。
: <global-exception-mappings>
:   <exception-mapping result="fail" exception="java.lang.Exception"></exception-mapping>
: </global-exception-mappings>

返回结果，即 result，同样，我们需要在当前 action 下面配置。相应，可以在 package 下面配置全局的结果返回。
: <global-results>
: 	<result name="fail">/WEB-INF/login/login.jsp</result>
: </global-results>


Action 类的典型示例如下，很简单：

#+BEGIN_SRC java
public Class LoginAction () {
    private String name;
    private int age;
    
    public String execute () {
        System.out.println("名字是:" + name + "    年龄为:" + age);
        return "success";
    }

    // setter...
    // setter...
}

#+END_SRC


* Result
如果不指定名字，那么默认的名字就是 success, 如果不指定 type，默认的 type 就是 dispatcher。我们常用的就是一下几个。
** dispatcher/redirect
转发或者重定向，一般用于 jsp
#+BEGIN_SRC xml
<result type="redirect" name="fail">/WEB-INF/jsp/login/fail.jsp</result>
#+END_SRC

如果 result 不指定类型的话，那么默认为 dispatcher.

** chain/redirectAction
转发或者重定向 xxx.action，用于一个新的 struts 请求。

如果要转发到另外一个包下的连接的话：
#+BEGIN_SRC xml
<result name="success" type="chain">
	<param name="namespace">/emp</param>
	<param name="actionName">listAll</param>
</result>
#+END_SRC

如果要重定向到另外一个包下面的请求的话，有下面两种写法：
#+BEGIN_SRC xml
<!-- 下面两种写法是等效的 -->
<result type="redirectAction">
	<param name="namespace">/emp</param>
	<param name="actionName">listAll</param>
</result>

<result type="redirect">/emp/listAll.html</result>
#+END_SRC

** stream
是用来处理 struts 中文件的上传和下载的。






   

* 流程
1. 请求发送给 StrutsPrepareAndExecuteFilter
2. StrutsPrepareAndExecuteFilter 询问 ActionMapper：请求是不是一个 Action(是的话返回非空的 ActionMapping)
3. 如果请求是一个 Action，则把请求交给 ActionProxy 对象处理。
4. ActionProxy 中，通过 ConfigurationManager 加载配置文件，得到处理请求的 Action 类和方法。
5. ActionProxy 创建一个 ActionInvocation 实例并初始化。
6. ActionInvocation 负责调用 Action，在调用的前后，需要执行 Interceptor 链。在调用完 Action 后要执行 result 的结果。
7. 把结果发送到客户端。

* 拦截器
所有实现了 Interceptor 接口的类，都叫拦截器。
在 Struts 中，是利用拦截器进行功能实现的，比如值的自动封装，类型的转换，值栈的维护，验证，国际化等方面。
每一个拦截器都实现用来完成单一的功能。多个拦截器，按照顺序放在一个列表中，按照顺序执行，可以达到完成一系列功能的目的。
这多个的拦截器放在一起，又称为拦截器栈（栈是一种非常基本的数据结构，它遵守先进后出的原则。简单理解，它是有顺序的一个列表）。

比如，在 struts 中，对值进行自动封装的拦截器叫 ParameterFilterInterceptor；对异常处理的拦截器叫 ExceptionMappingInterceptor，其他所有功能，在 struts 中都有相应的拦截器实现。

所以，在一个请求发起，经 struts 进行处理，程序流程在到达 action 相关的处理方法之前，会按照配置经过多个拦截器，从而实现一定的功能，比如，值的封装:
: 拦截器a -> 拦截器 B -> 拦截器 C -> 拦截器 D ... -> Action.Method -> 后续的一些处理，包括返回显示页面等。

在 struts.xml 中，需要为每个 action 设置拦截器，用来实现完整功能。
当然，如果我们不对 action 设置 interceptor-ref 节点，即不设置拦截器，那么如果我们的包继承了 struts-default，那么任何一个包内的 action，会默认使用 defaultStack 拦截器。它其实是一个拦截器栈，即是一系列的拦截器的一个列表。

** 原理
** 定义
** 示例
* 自动封装(Autowired)
* 值栈
EL(Expression Language) 是为了分离页面跟代码，避免JSP中糅杂太多<% %>而出现的。\\

它有如下好处：
- 避免复杂的java代码，使页面简单整洁
- 支持运算符，自由强大高效
- 有简单的逻辑控制，易于阅读和维护

Struts2 支持的 EL 语言有：
1. OGNL (Object-Graph Navigation Language) // Struts 默认
2. JSTL (JSP Standard Tag Library)                 // JSP2.0集成
3. Groovy
4. Velocity，只是一个简单的模板匹配引擎啦

Expression, Root, Context. getValue. setValue.


值栈是 struts 进行数据传递的中心，它是 struts 运行过程中创建的一个对象。本质上它是保存在 request 对象上的一个 attribute.

在 Struts 中，值栈（ValueStack）分为两个逻辑部分
1. 对象栈

   它其实是 Map 栈中的一个值。是作为一个默认的存在。本质上它是一个 ArrayList， Struts 在接受到一个请求的时候，会把创建的 Action 对象保存到这个 ArrayList 中。

2. Map栈
   
   本质上就是一个 Map，它是对 ActionContent 的引用。Struts 把一些常用的映射关系（比如，session,application,parameters等）保存到了这个对象中。
   
   Map 栈的大致结构如下:


在 jsp 页面中，如果打开了 devMove 模式，那么可以通过 <s:debug /> 查看整个值栈中保存的数据。


