struts.org
** 在 jsp 中获取值栈的值
首先，可以使用 <s:property /> 标签，通过在 value 属性里面的 ognl 表达式，就可以取到值栈中对应的值了。

ognl 表达式的语法规则为：
: #key.a.b.c

当然，如果我们要获取的值，是属于 OgnlContext 的 Root 对象，那么，前面的 #key 可以去掉。

因此，如果我们在 Action 里面定义了变量（比如，price），并赋予了值，那么，到 jsp 页面中，我们就可以直接用下面语句取出它的值：
: <s:property value="price" />

如果，我们要显示的值，是一个集合，比如，list，那么我们可以用 <s:iterator /> 标签循环取出它里面的值。
#+BEGIN_SRC java
<s:iterator var="j" value="emps">
	<tr>
		<td>${name}</td>
		<td><s:property value="job"/></td>
		<td><s:property value="#j.sal"/></td>
		<td><a href="delete.html?ename=${name}">删除</a></td>
	</tr>
</s:iterator>
#+END_SRC


注意，因为 struts 中对 request 对象进行了封装，并且重载了它的 getAttribute 方法，使得可以通过 getAttribute 方法直接从值栈对象中获取值。
所以，如果我们在 jsp 页面中，使用el表达式，可以达到跟使用 <s:property /> 标签同样的效果。


** 在 action 类中，获取 session 等对象的方法
在 action 中，向 session 中加入值，有如下几张方法：
#+BEGIN_SRC java
// 第一种，从 ServletActionContext提供的静态方法获取。
// 比如，ServletActionContext.getRequest() 得到的是一个原生的 HttpServletRequest 对象。得到后我们可以按照以前写 servlet 时候的写法处理这个对象。
// 所以，如果想得到回话对象的话，那么如下代码：
HttpSession s1 = ServletActionContext.getRequest().getSession();
s1.setAttribute("flag1", "red");

// struts 提供了另外一种封装，即把 session,request 等当做 Map 对象来处理，达到简化我们操作的目的。
Map<String, Object> s2 = ActionContext.getContext().getSession();
s2.put("flag2", "green");

// 通过实现 SessionAware 接口，定义全局的 session 对象。
// 首先要定义全局的 Map<String, Object> s3 = null; 然后实现 SessionAware 接口。
s3.put("flag3", "yellow");

#+END_SRC

在 jsp 页面中，这样使用session中的值。
: <s:property value="#session.flag" />





* 标签库
* 验证
调用的 xwork 中的验证配置
1. 声明式验证
   : ActionName[-Alias]-validation.xml
2. 编程式验证
   : @Override public void validate () {}



* 类型转换
struts 会自动进行类型转换。但一些复杂的对象，自动转换会满足不了我们的需求，这时候需要自定义类型转换器
1. 创建转换器。必须要实现 ognl.TypeConverter 接口。实际上继承 StrutsTypeConverter 即可。
2. 基于字段，model/ModelClassName-conversion.properties。基于类型，src/xwork-conversion.properties
    : java.util.Date=你定义的类型转换器


* 国际化
* 文件的上传下载
* 防止重复提交
三种情况：
1. 多次点击
2. 回退，再提交
2. 转发时 F5 刷新

解决方案： token 拦截器/ tokenSession 拦截器
1. 在配置文件中添加 token 拦截器，它不包含在默认拦截器栈中。
2. 添加标签 <s:token />，会在页面生成一个隐藏域并在session赋值，两个一致。
3. 若使用 token 拦截器，需要配置一个 token.valid 的 result，因为它要跳往错误页面
4. tokenSession 则不用配置 result。页面不会动。tokenSession 拦截器不会执行后续拦截器。

* ajax
