struts.html


<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">在 jsp 中获取值栈的值</h3>
<div class="outline-text-3" id="text-11-1">
<p>
首先，可以使用 &lt;s:property /&gt; 标签，通过在 value 属性里面的 ognl 表达式，就可以取到值栈中对应的值了。
</p>

<p>
ognl 表达式的语法规则为：
</p>
<pre class="example">
#key.a.b.c
</pre>

<p>
当然，如果我们要获取的值，是属于 OgnlContext 的 Root 对象，那么，前面的 #key 可以去掉。
</p>

<p>
因此，如果我们在 Action 里面定义了变量（比如，price），并赋予了值，那么，到 jsp 页面中，我们就可以直接用下面语句取出它的值：
</p>
<pre class="example">
&lt;s:property value="price" /&gt;
</pre>

<p>
如果，我们要显示的值，是一个集合，比如，list，那么我们可以用 &lt;s:iterator /&gt; 标签循环取出它里面的值。
</p>
<div class="org-src-container">

<pre class="src src-java">&lt;s:iterator var=<span style="color: #008000;">"j"</span> value=<span style="color: #008000;">"emps"</span>&gt;
  &lt;tr&gt;
    &lt;td&gt;$<span style="color: #707183;">{</span>name<span style="color: #707183;">}</span>&lt;/td&gt;
    &lt;td&gt;&lt;s:property value=<span style="color: #008000;">"job"</span>/&gt;&lt;/td&gt;
    &lt;td&gt;&lt;s:property value=<span style="color: #008000;">"#j.sal"</span>/&gt;&lt;/td&gt;
    &lt;td&gt;&lt;a href=<span style="color: #008000;">"delete.html?ename=${name}"</span>&gt;<span style="color: #6434A3;">&#21024;&#38500;</span><span style="color: #707183;">&lt;</span>/a<span style="color: #707183;">&gt;</span>&lt;/td&gt;
  &lt;/tr&gt;
&lt;/s:iterator&gt;
</pre>
</div>


<p>
注意，因为 struts 中对 request 对象进行了封装，并且重载了它的 getAttribute 方法，使得可以通过 getAttribute 方法直接从值栈对象中获取值。
所以，如果我们在 jsp 页面中，使用el表达式，可以达到跟使用 &lt;s:property /&gt; 标签同样的效果。
</p>
</div>
</div>


<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2">在 action 类中，获取 session 等对象的方法</h3>
<div class="outline-text-3" id="text-11-2">
<p>
在 action 中，向 session 中加入值，有如下几张方法：
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#31532;&#19968;&#31181;&#65292;&#20174; ServletActionContext&#25552;&#20379;&#30340;&#38745;&#24577;&#26041;&#27861;&#33719;&#21462;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#27604;&#22914;&#65292;ServletActionContext.getRequest() &#24471;&#21040;&#30340;&#26159;&#19968;&#20010;&#21407;&#29983;&#30340; HttpServletRequest &#23545;&#35937;&#12290;&#24471;&#21040;&#21518;&#25105;&#20204;&#21487;&#20197;&#25353;&#29031;&#20197;&#21069;&#20889; servlet &#26102;&#20505;&#30340;&#20889;&#27861;&#22788;&#29702;&#36825;&#20010;&#23545;&#35937;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25152;&#20197;&#65292;&#22914;&#26524;&#24819;&#24471;&#21040;&#22238;&#35805;&#23545;&#35937;&#30340;&#35805;&#65292;&#37027;&#20040;&#22914;&#19979;&#20195;&#30721;&#65306;</span>
<span style="color: #6434A3;">HttpSession</span> <span style="color: #BA36A5;">s1</span> = ServletActionContext.getRequest<span style="color: #707183;">()</span>.getSession<span style="color: #707183;">()</span>;
s1.setAttribute<span style="color: #707183;">(</span><span style="color: #008000;">"flag1"</span>, <span style="color: #008000;">"red"</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">struts &#25552;&#20379;&#20102;&#21478;&#22806;&#19968;&#31181;&#23553;&#35013;&#65292;&#21363;&#25226; session,request &#31561;&#24403;&#20570; Map &#23545;&#35937;&#26469;&#22788;&#29702;&#65292;&#36798;&#21040;&#31616;&#21270;&#25105;&#20204;&#25805;&#20316;&#30340;&#30446;&#30340;&#12290;</span>
<span style="color: #6434A3;">Map</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span><span style="color: #707183;">&gt;</span> <span style="color: #BA36A5;">s2</span> = ActionContext.getContext<span style="color: #707183;">()</span>.getSession<span style="color: #707183;">()</span>;
s2.put<span style="color: #707183;">(</span><span style="color: #008000;">"flag2"</span>, <span style="color: #008000;">"green"</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36890;&#36807;&#23454;&#29616; SessionAware &#25509;&#21475;&#65292;&#23450;&#20041;&#20840;&#23616;&#30340; session &#23545;&#35937;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#39318;&#20808;&#35201;&#23450;&#20041;&#20840;&#23616;&#30340; Map&lt;String, Object&gt; s3 = null; &#28982;&#21518;&#23454;&#29616; SessionAware &#25509;&#21475;&#12290;</span>
s3.put<span style="color: #707183;">(</span><span style="color: #008000;">"flag3"</span>, <span style="color: #008000;">"yellow"</span><span style="color: #707183;">)</span>;
</pre>
</div>

<p>
在 jsp 页面中，这样使用session中的值。
</p>
<pre class="example">
&lt;s:property value="#session.flag" /&gt;
</pre>
</div>
</div>
</section>





<section id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">标签库</h2>
</section>
<section id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">验证</h2>
<div class="outline-text-2" id="text-13">
<p>
调用的 xwork 中的验证配置
</p>
<ol class="org-ol">
<li>声明式验证
<pre class="example">
ActionName[-Alias]-validation.xml
</pre>
</li>
<li>编程式验证
<pre class="example">
@Override public void validate () {}
</pre>
</li>
</ol>
</div>
</section>



<section id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">类型转换</h2>
<div class="outline-text-2" id="text-14">
<p>
struts 会自动进行类型转换。但一些复杂的对象，自动转换会满足不了我们的需求，这时候需要自定义类型转换器
</p>
<ol class="org-ol">
<li>创建转换器。必须要实现 ognl.TypeConverter 接口。实际上继承 StrutsTypeConverter 即可。
</li>
<li>基于字段，model/ModelClassName-conversion.properties。基于类型，src/xwork-conversion.properties
<pre class="example">
java.util.Date=你定义的类型转换器
</pre>
</li>
</ol>
</div>
</section>


<section id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">国际化</h2>
</section>
<section id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">文件的上传下载</h2>
</section>
<section id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">防止重复提交</h2>
<div class="outline-text-2" id="text-17">
<p>
三种情况：
</p>
<ol class="org-ol">
<li>多次点击
</li>
<li>回退，再提交
</li>
<li>转发时 F5 刷新
</li>
</ol>

<p>
解决方案： token 拦截器/ tokenSession 拦截器
</p>
<ol class="org-ol">
<li>在配置文件中添加 token 拦截器，它不包含在默认拦截器栈中。
</li>
<li>添加标签 &lt;s:token /&gt;，会在页面生成一个隐藏域并在session赋值，两个一致。
</li>
<li>若使用 token 拦截器，需要配置一个 token.valid 的 result，因为它要跳往错误页面
</li>
<li>tokenSession 则不用配置 result。页面不会动。tokenSession 拦截器不会执行后续拦截器。
</li>
</ol>
</div>
</section>

<section id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">ajax</h2>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: imfine</p>
<p class="date">Created: 2016-10-18 周二 07:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
